[
  {
    "id": "ict-01",
    "youtubeId": "WiQoTT5lBwA",
    "title": "ICT Chapter 3 ✪ Class : 01",
    "description": "A complete overview of Information and Communication Technology, its components, and its role in the modern world.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2024-01-15",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. ACS HSC 27 batch- ACS ICT Decoder, ACS Physics Apar- Apurbo, ACS Aloron Chemistry by Mottasin Paholvi for HSC 27, ACS Chemshifu Chemistry by Sanjay Chakraborty for HSC 27, ACS Hemel Vhai chemistry for HSC 27, ACS Higher Math by Abhi Datta Tusher for HSC 27, ACS DMC Dreamers biology for HSC 27, ACS BioMission Biology for HSC 27, ACS Bangla and English Course for HSC 26 & HSC 27.SEO FRIENDLY Site. This video covers the fundamental concepts of ICT, including hardware, software, networking, and data. It's perfect for beginners looking to understand the basics of the digital landscape and its impact on society."
  },
  {
    "id": "ict-02",
    "youtubeId": "v5IHARqkmCg",
    "title": "ICT Chapter 3 ✪ Class : 02",
    "description": "Learn the basics of HTML to start building your very first websites from scratch.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2024-02-20",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. ACS HSC 27 batch- ACS ICT Decoder, ACS Physics Apar- Apurbo, ACS Aloron Chemistry by Mottasin Paholvi for HSC 27, ACS Chemshifu Chemistry by Sanjay Chakraborty for HSC 27, ACS Hemel Vhai chemistry for HSC 27, ACS Higher Math by Abhi Datta Tusher for HSC 27, ACS DMC Dreamers biology for HSC 27, ACS BioMission Biology for HSC 27, ACS Bangla and English Course for HSC 26 & HSC 27.SEO FRIENDLY Site. This crash course on HTML5 covers all the essential tags and structure needed to create web pages. Topics include headings, paragraphs, links, images, lists, tables, and forms."
  },
  {
    "id": "ict-03",
    "youtubeId": "nM3bsPn5hxw",
    "title": "ICT Chapter 3 ✪ Class : 03",
    "description": "Understand how computers connect and communicate with each other over networks.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2024-03-10",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. ACS HSC 27 batch- ACS ICT Decoder, ACS Physics Apar- Apurbo, ACS Aloron Chemistry by Mottasin Paholvi for HSC 27, ACS Chemshifu Chemistry by Sanjay Chakraborty for HSC 27, ACS Hemel Vhai chemistry for HSC 27, ACS Higher Math by Abhi Datta Tusher for HSC 27, ACS DMC Dreamers biology for HSC 27, ACS BioMission Biology for HSC 27, ACS Bangla and English Course for HSC 26 & HSC 27.SEO FRIENDLY Site. Explore the core concepts of computer networking, including IP addresses, DNS, TCP/IP protocols, routers, and switches. This lesson breaks down complex topics into easy-to-understand segments."
  },
  {
    "id": "ict-04",
    "youtubeId": "J4xt4xdq0P4",
    "title": "ICT Chapter 3 ✪ Class : 04",
    "description": "A beginner-friendly introduction to programming concepts using the Python language.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2024-04-05",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. ACS HSC 27 batch- ACS ICT Decoder, ACS Physics Apar- Apurbo, ACS Aloron Chemistry by Mottasin Paholvi for HSC 27, ACS Chemshifu Chemistry by Sanjay Chakraborty for HSC 27, ACS Hemel Vhai chemistry for HSC 27, ACS Higher Math by Abhi Datta Tusher for HSC 27, ACS DMC Dreamers biology for HSC 27, ACS BioMission Biology for HSC 27, ACS Bangla and English Course for HSC 26 & HSC 27.SEO FRIENDLY Site. Start your programming journey with Python. This video explains variables, data types, loops, conditional statements, and functions. No prior coding experience is required."
  },
  {
    "id": "ict-05",
    "youtubeId": "FqRm6ao-ip4",
    "title": "ICT Chapter 3 ✪ Class : 05",
    "description": "Learn what databases are, why they are important, and how they work.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2024-05-18",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. ACS HSC 27 batch- ACS ICT Decoder, ACS Physics Apar- Apurbo, ACS Aloron Chemistry by Mottasin Paholvi for HSC 27, ACS Chemshifu Chemistry by Sanjay Chakraborty for HSC 27, ACS Hemel Vhai chemistry for HSC 27, ACS Higher Math by Abhi Datta Tusher for HSC 27, ACS DMC Dreamers biology for HSC 27, ACS BioMission Biology for HSC 27, ACS Bangla and English Course for HSC 26 & HSC 27.SEO FRIENDLY Site. This video introduces relational databases, SQL (Structured Query Language), and the concept of tables, rows, and columns. Understand how data is stored, managed, and retrieved efficiently."
  },
  {
    "id": "ict-06",
    "youtubeId": "rePrCuNI6Ck",
    "title": "ICT Chapter 3 ✪ Class : 06",
    "description": "Unlock the fundamentals of **Number Systems and Digital Devices** with this comprehensive ICT Chapter 3 lesson. Explore binary, octal, decimal, and hexadecimal conversions, alongside essential digital logic gates and their applications. Master the building blocks of computing with SEO-optimized content designed for easy understanding and retention.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2025-09-19",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. SEO FRIENDLY site. This ICT class focuses on an in-depth understanding of number systems, including conversions and arithmetic, and introduces core concepts of digital devices crucial for computer science students."
  },
  {
    "id": "ict-07",
    "youtubeId": "cCXDfgjUgOg",
    "title": "ICT Chapter 3 ✪ Class : 07",
    "description": "Dive deeper into **Number Systems and Digital Devices** in this advanced ICT Chapter 3 session. Learn about signed number representations, floating-point numbers, and complex logic circuits. This video provides detailed explanations and practical examples, enhancing your understanding of digital electronics and data representation.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2025-09-18",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. SEO FRIENDLY site. This ICT class explores advanced topics in number systems and the operational principles of various digital devices, preparing students for complex problem-solving in digital electronics."
  },
  {
    "id": "ict-08",
    "youtubeId": "0r-FR8aapzU",
    "title": "ICT Chapter 3 ✪ Class : 08",
    "description": "Master **Boolean Algebra and Logic Gates** with this essential ICT Chapter 3 lesson. Understand fundamental theorems, De Morgan's laws, and how to design and simplify digital circuits. Perfect for students seeking to ace their exams and build a strong foundation in digital logic with SEO-rich explanations.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2025-09-17",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. SEO FRIENDLY site. This ICT class demystifies Boolean algebra, truth tables, and the application of logic gates in constructing digital circuits, making complex topics accessible for learners."
  },
  {
    "id": "ict-09",
    "youtubeId": "zXzSQU_6xR4",
    "title": "ICT Chapter 3 ✪ Class : 09",
    "description": "Explore **Combinational and Sequential Logic Circuits** in this in-depth ICT Chapter 3 class. Learn about adders, subtractors, multiplexers, decoders, flip-flops, and counters. This video covers essential concepts for understanding memory and processing units in digital systems, optimized for search engines.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2025-09-16",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. SEO FRIENDLY site. This ICT class delves into the design and function of combinational and sequential circuits, explaining how these components form the backbone of modern digital computing and memory."
  },
  {
    "id": "ict-10",
    "youtubeId": "TM2Q4y4obTg",
    "title": "ICT Chapter 3 ✪ Class : 10",
    "description": "Conclude your journey through **Number Systems and Digital Devices** with this final ICT Chapter 3 class. Review key concepts, tackle advanced problems, and prepare for your exams with expert insights. This video ensures a solid grasp of all topics, providing a comprehensive summary and problem-solving strategies for digital logic.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2025-09-15",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. SEO FRIENDLY site. This final ICT class for Chapter 3 consolidates understanding of number systems and digital devices through comprehensive review and advanced problem-solving techniques."
  },
  {
    "id": "ict-11",
    "youtubeId": "2tv8CwaKqX8",
    "title": "ICT Chapter 4 ✪ Class : 01",
    "description": "Begin your journey into **HTML (HyperText Markup Language)** with this introductory ICT Chapter 4 lesson. Learn the basic structure of an HTML document, essential tags, and how to create your first web page. This beginner-friendly tutorial provides a strong foundation for web development with practical examples and SEO-friendly explanations.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2025-09-14",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. SEO FRIENDLY site. This ICT class introduces the fundamental concepts of HTML, covering basic document structure, common tags, and how to create simple web pages, perfect for aspiring web developers."
  },
  {
    "id": "ict-12",
    "youtubeId": "NR2jUlJOnTg",
    "title": "ICT Chapter 4 ✪ Class : 02",
    "description": "Expand your **HTML skills** in this second ICT Chapter 4 class. Discover how to format text, add images, create hyperlinks, and structure content effectively. This lesson provides practical tips and techniques for building visually appealing and navigable web pages, optimized for web search.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2025-09-13",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. SEO FRIENDLY site. This ICT class builds upon basic HTML, focusing on text formatting, image insertion, hyperlink creation, and effective content organization to enhance web page design."
  },
  {
    "id": "ict-13",
    "youtubeId": "uYeuCz848Jo",
    "title": "ICT Chapter 4 ✪ Class : 03",
    "description": "Master **HTML Tables and Forms** in this advanced ICT Chapter 4 lesson. Learn to create complex data tables, design interactive input forms, and collect user data efficiently. This tutorial is packed with examples and best practices for creating dynamic and functional web content, enhanced for SEO.",
    "duration": "Lifetime Free Access",
    "category": "ICT",
    "uploadDate": "2025-09-12",
    "summary": "Education should be free for All. This video is pirated. This website will provide you free courses of ACS and other platforms. Unless you invite your friends, I won't give any free class. If I don't upload any video for some days, you must invite people to get new videos. SEO FRIENDLY site. This ICT class covers the creation of HTML tables for structured data display and interactive forms for user input, providing essential skills for dynamic web development."
  }
]